Hey @bogdan-cioata, I tried reproducing this but wasn't able to. Any chance you could share your `dbtcloud_webhook` config? I've attached the one I used below.

```hcl
resource "dbtcloud_webhook" "test_webhook" {
  name        = "test-webhooking"
  description = "Test webhooking"
  client_url  = "http://localhost/nothing"
  event_types = [
    "job.run.started",
    "job.run.completed"
  ]
  job_ids = [
    70403104297009,
    70403104237672,
    70403104287539,
    70403104330207,
    ]
}
```

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # dbtcloud_webhook.test_webhook will be created
  + resource "dbtcloud_webhook" "test_webhook" {
      + account_identifier = (known after apply)
      + active             = true
      + client_url         = "http://localhost/nothing"
      + description        = "Test webhooking"
      + event_types        = [
          + "job.run.started",
          + "job.run.completed",
        ]
      + hmac_secret        = (sensitive value)
      + http_status_code   = (known after apply)
      + id                 = (known after apply)
      + job_ids            = [
          + 70403104297009,
          + 70403104237672,
          + 70403104287539,
          + 70403104330207,
        ]
      + name               = "test-webhooking"
      + webhook_id         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

dbtcloud_webhook.test_webhook: Creating...
dbtcloud_webhook.test_webhook: Creation complete after 0s [id=wsu_3BCQuWRqTf4eRTpgKWej8uIK5PP]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```